# UnableToConvertGroupsToLinks Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToConvertGroupsToLinks Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to convert the selected groups to links.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToConvertGroupsToLinks { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToConvertGroupsToLinks As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToConvertGroupsToLinks {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace